#لیست ها و تغییر اجزای آن و تعداد اعضای یک لیست
a = [1,2,5,'ali',True]
print(a)

a[0] = 5
print(a)

print(len(a))




#دریافت خروجی بازه ای از لیست
a = [1,2,5,'ali',True]
print(a[1:4])
print(a[-1])
print(a[-3:-1]) #وقتی عدد داخل براکت منفی میزاریم از آخر لیست اجزای آن را استحراج میکنیم 







#حلقه در پایتون برای استخراج کل لیست و متود لیست که روش دوم ساخت لیست است
b = list((2,5,6,7,9,10))

for i in b :
    print(i)
    
    
    
    
    
#متود اینزرت برای اضافه کردن یک عضو به لیست
b = list((2,5,6,7,9,10))
b.insert(2,"hosein") #وقتی نوشتیم دو حسین => یعنی حسین رو پشت سومین عضو اضافه کن 
print(b)






#با این متود لیستa رو به انتهای لیستb اضافه میکنیم
a = list((1,3,5,7,9,11))
b = [2,4,6,True,9,"hosein"]

b.extend(a)
print(b)





#با این متود هر کدوم از اعضای انتخابی a رو به انتهای b  اضافه میکنیم
a = list((1,3,5,7,9,11))
b = [2,4,6,True,9,"hosein"]

b.append(a[3])  #یعنی عضو چهارم از لیست a
print(b)




#حذف اعضای انتحابی از لیست
b = [2,4,6,True,9,5,"hosein"]
b.remove(5) #یعنی عدد 5 رو از لیست حذف کن
print(b)





#حذف اعضای انتحابی از لیست
b = [2,4,6,True,9,5,"hosein",5]
b.remove(5) #چون دو تا 5 هست اولی رو حذف کرد فقط
print(b)


c = [5,4,6,True,9,5,"hosein",5,5]
c.remove(5) #چون چند تا 5 هست اولی رو حذف کرد فقط
print(c)







#حذف کل اعضای لیست
b = [2,4,6,True,9,5,"hosein",5]
b.clear()
print(b)







#حذف آخرین عضو از لیست
b = [2,4,6,True,9,5,"hosein",5]
b.pop()
print(b)





#مرتب کردن اعضا از کوچیک به بزرگ و برعکس
a = [1,3,6,9,2]
b = [1,3,6,9,2]
a.sort() 
b.sort(reverse=True)
print(a)
print(b)